Revit 2027 API
AssetSet.Contains Method
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	Asset item
)
Public Overridable Function Contains (
	item As Asset
) As Boolean
public:
virtual bool Contains(
	Asset^ item
)
abstract Contains :
        item : Asset -> bool
override Contains :
        item : Asset -> bool
Parameters
item Asset
Return Value
Boolean
See Also
Reference
AssetSet Class
Autodesk.Revit.DB.Visual Namespace